In [1]:
import pandas as pd

In [2]:
val=pd.DataFrame([1,2,4,5,6])

val

   0
0  1
1  2
2  4
3  5
4  6

In [3]:
stu={
    "names":["Ahmed","Ali","Hassan","Hussain","ALi Hussain","Baqir"],
    "age":[22,25,45,67,67,55]
}

stuFram=pd.DataFrame(stu)
print(stuFram)

         names  age
0        Ahmed   22
1          Ali   25
2       Hassan   45
3      Hussain   67
4  ALi Hussain   67
5        Baqir   55

***
**Accessing specific columns with specific index**

In [4]:
col=pd.DataFrame(stu,index=["i","ii","iii","iv","v","vi"])
col

           names  age
i          Ahmed   22
ii           Ali   25
iii       Hassan   45
iv       Hussain   67
v    ALi Hussain   67
vi         Baqir   55

In [5]:
l2=[[2,4,6,8],[12,14,16,18]]
val2=pd.DataFrame(l2)

val2

    0   1   2   3
0   2   4   6   8
1  12  14  16  18

In [6]:
val2[0][1]

12

***
# DataFrame using series

In [17]:
srDF=pd.DataFrame({"names":["Ahmed","Ali","Hassan"],"ages":[12,15,14]})
srDF

    names  ages
0   Ahmed    12
1     Ali    15
2  Hassan    14

***